Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/Atmel.SAM4E_DFP.pdsc
      <condition id="ATSAM4E16E">
         <require Dvendor="Atmel:3" Dname="ATSAM4E16E"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4E16CB">
         <require Dvendor="Atmel:3" Dname="ATSAM4E16CB"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4E16C">
         <require Dvendor="Atmel:3" Dname="ATSAM4E16C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4E8C">
         <require Dvendor="Atmel:3" Dname="ATSAM4E8C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4E8E">
         <description>Headers and startup code for Atmel ATSAM4E8E</description>
         <files>
            <file condition="C" category="include" name="ic.sam4e/include"/>
            <file condition="C" category="header" name="ic.sam4e/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/system_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/gcc/startup_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="ic.sam4e/gcc/gcc/sam4e8e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e8e_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/ARM/startup_SAM4E.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/system_SAM4E.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4E8CB">
         <description>Headers and startup code for Atmel ATSAM4E8CB</description>
         <files>
            <file condition="C" category="include" name="ic.sam4ecb/include"/>
            <file condition="C" category="header" name="ic.sam4ecb/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4ecb/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4ecb/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4ecb/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4ecb/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4ecb/gcc/system_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4ecb/gcc/gcc/startup_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="ic.sam4ecb/gcc/gcc/sam4e8cb_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4ecb/gcc/gcc/sam4e8cb_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4ecb/gcc/gcc/sam4e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4ecb/gcc/gcc/sam4e_sram.ld"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4E16E">
         <description>Headers and startup code for Atmel ATSAM4E16E</description>
         <files>
            <file condition="C" category="include" name="ic.sam4e/include"/>
            <file condition="C" category="header" name="ic.sam4e/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/system_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/gcc/startup_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="ic.sam4e/gcc/gcc/sam4e16e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e16e_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/ARM/startup_SAM4E.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/system_SAM4E.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4E16CB">
         <description>Headers and startup code for Atmel ATSAM4E16CB</description>
         <files>
            <file condition="C" category="include" name="ic.sam4ecb/include"/>
            <file condition="C" category="header" name="ic.sam4ecb/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4ecb/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4ecb/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4ecb/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4ecb/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4ecb/gcc/system_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4ecb/gcc/gcc/startup_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="ic.sam4ecb/gcc/gcc/sam4e16cb_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4ecb/gcc/gcc/sam4e16cb_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4ecb/gcc/gcc/sam4e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4ecb/gcc/gcc/sam4e_sram.ld"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4E16C">
         <description>Headers and startup code for Atmel ATSAM4E16C</description>
         <files>
            <file condition="C" category="include" name="ic.sam4e/include"/>
            <file condition="C" category="header" name="ic.sam4e/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/system_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/gcc/startup_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="ic.sam4e/gcc/gcc/sam4e16c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e16c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/ARM/startup_SAM4E.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/system_SAM4E.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4E8C">
         <description>Headers and startup code for Atmel ATSAM4E8C</description>
         <files>
            <file condition="C" category="include" name="ic.sam4e/include"/>
            <file condition="C" category="header" name="ic.sam4e/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="ic.sam4e/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="ic.sam4e/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/system_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="ic.sam4e/gcc/gcc/startup_sam4e.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="ic.sam4e/gcc/gcc/sam4e8c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e8c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="ic.sam4e/gcc/gcc/sam4e_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/ARM/startup_SAM4E.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="ic.sam4e/armcc/Device/Source/system_SAM4E.c"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
